Journal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga6d674a">2022</a>
<ul>
<li><a href="#org47c678f">2022-07 July</a>
<ul>
<li><a href="#org5cf1daa">2022-07-29 Friday</a></li>
<li><a href="#org3f2bd50">2022-07-30 Saturday</a></li>
</ul>
</li>
<li><a href="#org727935c">2022-08 August</a>
<ul>
<li><a href="#org3710f34">2022-08-01 Monday</a></li>
<li><a href="#orge05cf74">2022-08-02 星期二</a></li>
<li><a href="#orgc8f7a32">2022-08-03 Wednesday</a></li>
<li><a href="#orgcc0f49f">2022-08-04 Thursday</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga6d674a" class="outline-2">
<h2 id="orga6d674a">2022</h2>
<div class="outline-text-2" id="text-orga6d674a">
</div>
<div id="outline-container-org47c678f" class="outline-3">
<h3 id="org47c678f">2022-07 July</h3>
<div class="outline-text-3" id="text-org47c678f">
</div>
<div id="outline-container-org5cf1daa" class="outline-4">
<h4 id="org5cf1daa">2022-07-29 Friday</h4>
<div class="outline-text-4" id="text-org5cf1daa">
</div>
<ul class="org-ul">
<li><a id="org601d85d"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-07-29 Fri 23:54] </span></span> 洗完澡了<br /></li>
</ul>
</div>

<div id="outline-container-org3f2bd50" class="outline-4">
<h4 id="org3f2bd50">2022-07-30 Saturday</h4>
<div class="outline-text-4" id="text-org3f2bd50">
</div>
<ul class="org-ul">
<li><a id="orgef09a59"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-07-30 Sat 09:57]</span></span><br />
<div class="outline-text-5" id="text-orgef09a59">
<p>
带豆子两包
</p>
</div>
</li>
<li><a id="org14f594d"></a>今日org快捷键<br />
<div class="outline-text-5" id="text-org14f594d">
<ul class="org-ul">
<li>C-c C-z 加入notes</li>
<li>C-c .   加入时间戳（会显示在agenda视图）</li>
<li>SPC-u C-c . 加入时间戳（不会显示在agenda视图）</li>
<li>C-c C-d  加入deadline</li>
</ul>
</div>
</li>
<li><a id="org8f72669"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-07-30 Sat 11:03] </span></span> org-capture 的函数文件<br />
<div class="outline-text-5" id="text-org8f72669">
<p>
<a href="file:///home/runner/.emacs.d/.local/straight/repos/org/lisp/org-capture.el#org09b36dc">file:///home/runner/.emacs.d/.local/straight/repos/org/lisp/org-capture.el#org09b36dc</a>
</p>
</div>
</li>
<li><a id="org007b0e1"></a>new way&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span><br />
<div class="outline-text-5" id="text-org007b0e1">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2022-07-30 Sat 11:21] </span></span> <br />
用journal来作为所有记事的入口
想加入todo，就用capture模版
想加新笔记 可以直接加入时间戳记录refile(C-c C-W)给journal（注意层级可选） 或用capture模版</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org727935c" class="outline-3">
<h3 id="org727935c">2022-08 August</h3>
<div class="outline-text-3" id="text-org727935c">
</div>
<div id="outline-container-org3710f34" class="outline-4">
<h4 id="org3710f34">2022-08-01 Monday</h4>
<div class="outline-text-4" id="text-org3710f34">
</div>
<ul class="org-ul">
<li><a id="org4a9ccd3"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-01 Mon 19:59]</span></span><br /></li>
<li><a id="org587f464"></a><span class="done DONE">DONE</span> org-mode 通过github在多设备间同步&#xa0;&#xa0;&#xa0;<span class="tag"><span class="magit">magit</span>&#xa0;<span class="sync">sync</span>&#xa0;<span class="org">org</span></span><br />
<div class="outline-text-5" id="text-org587f464">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2022-08-01 Mon 21:04] </span></span> <br />
已完成用magit push新仓库（org）
用SPC g g 来查看magit status
m表示add相关参数
M表示pull相关参数
s表示stage
c表示commit
f表示fetch
p表示push，如果仓库与本地内容有偏差，push之前要pull并加参数</li>
</ul>
</div>
</li>
<li><a id="org24e410d"></a><span class="done DONE">DONE</span> 学习org-capture-templates配置，将journal添加时间向下排序（prepend参数为t）<br />
<div class="outline-text-5" id="text-org24e410d">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 14:20] </span></span> <br />
用帮助文档中org-capture-templates中的customize即可，全图形化界面。</li>
</ul>
</div>
</li>
<li><a id="org3b87c37"></a><span class="todo TODO">TODO</span> 用org文件制作孩子周岁图片日记<br />
<div class="outline-text-5" id="text-org3b87c37">
</div>
</li>
<li><a id="org73a0ad8"></a><span class="todo TODO">TODO</span> 发一篇小红书，软路由相关<br />
<div class="outline-text-5" id="text-org73a0ad8">
</div>
</li>
<li><a id="orga495e2a"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-01 Mon 15:55]</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="network">network</span></span><br />
<div class="outline-text-5" id="text-orga495e2a">
<ul class="org-ul">
<li>交换机插1口可能是trunk口，因此无法访问管理地址及配置。</li>
</ul>
</div>
</li>

<li><a id="org0f31a83"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-01 Mon 06:56]</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="study">study</span></span><br />
<div class="outline-text-5" id="text-org0f31a83">
<ul class="org-ul">
<li>效率有所提升</li>
<li>org记笔记入门了</li>
</ul>
</div>
</li>
<li><a id="org735c23a"></a><span class="done DONE">DONE</span> 把journal写起来，上传github<br />
<div class="outline-text-5" id="text-org735c23a">
</div>
</li>
<li><a id="orgb3df15c"></a><span class="done DONE">DONE</span> 研究内网穿透（看稚晖君知乎的文章）&#xa0;&#xa0;&#xa0;<span class="tag"><span class="network">network</span></span><br />
<div class="outline-text-5" id="text-orgb3df15c">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2022-08-01 Mon 16:36] </span></span> <br />
<ul class="org-ul">
<li>tag只能作用在heading级别</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orge05cf74" class="outline-4">
<h4 id="orge05cf74">2022-08-02 星期二</h4>
<div class="outline-text-4" id="text-orge05cf74">
</div>
<ul class="org-ul">
<li><a id="org51ed1c9"></a><span class="done DONE">DONE</span> <span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 10:02] </span></span> 学习将网页内容一键拷贝到journal&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span>&#xa0;<span class="capture">capture</span></span><br />
<div class="outline-text-5" id="text-org51ed1c9">
</div>
<ul class="org-ul">
<li><a id="org67bbb32"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 10:50]</span></span>设置doom emacs的server，让org-capture-extension能够运行<br />
<div class="outline-text-6" id="text-org67bbb32">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 10:58] </span></span> <br />
org-capture-extension需要调用emacsclientw（server端）
 如果用的windows操作系统，按找教程来设置环境变量
 ！都是操作系统的环境变量惹的祸！</li>
</ul>
<p>
<a href="https://earvingad.github.io/posts/doom_emacs_windows/">Doom, Emacs &amp; Windows | Nerd things and more&#x2026;</a>
</p>
</div>
</li>

<li><a id="org6cf5c5e"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 10:56] </span></span> 实现网页capture的插件&#xa0;&#xa0;&#xa0;<span class="tag"><span class="capture">capture</span>&#xa0;<span class="chrome">chrome</span></span><br />
<div class="outline-text-6" id="text-org6cf5c5e">
<p>
<a href="https://github.com/sprig/org-capture-extension">sprig/org-capture-extension: A Chrome and firefox extension facilitating org-capture in emacs</a>
</p>
</div>
</li>

<li><a id="org8a309dd"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 11:00] </span></span> 通过这个文章学到的网页capture技巧&#xa0;&#xa0;&#xa0;<span class="tag"><span class="skills">skills</span>&#xa0;<span class="org">org</span>&#xa0;<span class="capture">capture</span></span><br />
<div class="outline-text-6" id="text-org8a309dd">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 11:12] </span></span> <br />
<ul class="org-ul">
<li>M-h（left） M-l（right）来快速调整标题层级</li>
</ul></li>
</ul>
<p>
<a href="https://emacs-china.org/t/emacs/10367">至尊 Emacs，捕获所有 - Emacs-general - Emacs China</a>
</p>
</div>
</li>
</ul>
</li>

<li><a id="orge8163bf"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 13:44]</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="doom">doom</span>&#xa0;<span class="capture">capture</span>&#xa0;<span class="config">config</span></span><br />
<div class="outline-text-5" id="text-orge8163bf">
<p>
Doom adds it's own templates. Your template is therefore overwritten when org is started.
The solution is to add your capture to the list of templates after org loads.
Put the following in your config.el:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(after! org (add-to-list 'org-capture-templates
             '((<span style="font-style: italic;">"d"</span> <span style="font-style: italic;">"Dream"</span> entry
               (file+headline +org-capture-todo-file <span style="font-style: italic;">"Dream"</span>)
               <span style="font-style: italic;">"* TODO %?\n :PROPERTIES:\n :CATEGORY: dream\n :END:\n %i\n"</span>
               <span style="font-weight: bold;">:prepend</span> t <span style="font-weight: bold;">:kill-buffer</span> t))
</pre>
</div>

<p>
[[<a href="https://github.com/doomemacs/doomemacs/issues/1391">https://github.com/doomemacs/doomemacs/issues/1391</a>][[QUESTION] org-capture-templates · Issue #1391 · doomemacs/doomemacs]]
</p>
</div>
</li>

<li><a id="org2cf9570"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 16:38]</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="doom">doom</span>&#xa0;<span class="capture">capture</span>&#xa0;<span class="templates">templates</span>&#xa0;<span class="config">config</span></span><br />
<div class="outline-text-5" id="text-org2cf9570">
<p>
Doom org-capture-templates configs 几个点
</p>
<ul class="org-ul">
<li>%a 代表把所在位置的文件加到capture里面去，形成链接</li>
<li>%U 代表在capture中加入日期和时间（%T是timestamp版的）</li>
</ul>
<p>
只要修改某个template的这两个参数，就可以改变capture显示内容
</p>
</div>
</li>

<li><a id="orgd67a9b6"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-02 Tue 22:20] </span></span> 软路由配置服务器参考<br />
<div class="outline-text-5" id="text-orgd67a9b6">
<p>
<a href="https://zhuanlan.zhihu.com/p/336429888">【保姆级教程】个人深度学习工作站配置指南 - 知乎</a>
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgc8f7a32" class="outline-4">
<h4 id="orgc8f7a32">2022-08-03 Wednesday</h4>
<div class="outline-text-4" id="text-orgc8f7a32">
</div>
<ul class="org-ul">
<li><a id="org53de95b"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-03 Wed 06:14]</span></span><br />
<ul class="org-ul">
<li><a id="org4e013ed"></a><span class="done DONE">DONE</span> 咖啡豆检查数量、新豆子发送<br />
<div class="outline-text-6" id="text-org4e013ed">
</div>
</li>
<li><a id="orgc60695e"></a><span class="done DONE">DONE</span> 窗贴约时间<br />
<div class="outline-text-6" id="text-orgc60695e">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2022-08-03 Wed 09:27] </span></span> <br />
明日安装，具体时间待定</li>
</ul>
</div>
</li>
<li><a id="org89a7990"></a><span class="done DONE">DONE</span> 外卖平台开启检查<br />
<div class="outline-text-6" id="text-org89a7990">
</div>
</li>
</ul>
</li>


<li><a id="org770d4ab"></a>数字+vim控制键是常用操作<br />
<div class="outline-text-5" id="text-org770d4ab">
<ul class="org-ul">
<li>如3o，在下面加三行并输入</li>
</ul>
</div>


<ul class="org-ul">
<li><a id="org4eecd19"></a><span class="todo TODO">TODO</span> 研究笔记布局展示<br />
<div class="outline-text-6" id="text-org4eecd19">
<ul class="org-ul">
<li>层级与功能如何分配</li>
<li>C-c C-z note 与 capture template的note 两个的使用场景区别</li>
</ul>
</div>
</li>
</ul>
</li>


<li><a id="org8325a8c"></a>git知识&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span></span><br />
<div class="outline-text-5" id="text-org8325a8c">
<p>
如果本地仓库与github上内容有区别造成无法pull（等于fetch+merge），先用git stash来暂存本地版本
stash之后，pull。之后用stash pop来将暂存版本与现有版本进行合并。
如果有冲突，再到文件中查找解决。
最后用git stash drop来把暂存版本删掉。
注意：如果没有pop成功就drop了，可以用git fsck查找版本，用git show来看具体哪个是删除的版本，查找的是commit类型。
</p>
</div>
</li>


<li><a id="org879ddc4"></a>设置capture显示日期语言为英语<br />
<div class="outline-text-5" id="text-org879ddc4">
<div class="org-src-container">
<pre class="src src-elisp-byte-code"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">System locale to use for formatting time values.</span>
(<span style="font-weight: bold;">setq</span> system-time-locale <span style="font-style: italic;">"C"</span>)         <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Make sure that the weekdays in the</span>
                           <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">time stamps of your Org mode files and</span>
                            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">in the agenda appear in English.</span>

</pre>
</div>
</div>
</li>

<li><a id="org69de4eb"></a>设置另一个capture-template<br />
<div class="outline-text-5" id="text-org69de4eb">
<ul class="org-ul">
<li>快捷键 pn</li>
<li>插入到journal下面</li>
<li>不自动插入日期时间</li>
<li>作为note使用</li>
</ul>
</div>
</li>


<li><a id="orgaf40e24"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-03 Wed 15:00] </span></span> 修改org字体、排版间距等&#xa0;&#xa0;&#xa0;<span class="tag"><span class="orgstyle">orgstyle</span></span><br />
<div class="outline-text-5" id="text-orgaf40e24">
<ul class="org-ul">
<li>模仿typora样式</li>
</ul>

<p>
<a href="https://qa.1r1g.cn/emacs/ask/3931371/">带有css样式的markdown/org模式文本的实时内联渲染包？ | 智问智答</a>
</p>
</div>
</li>


<li><a id="org4856341"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-03 Wed 15:32] </span></span> 油管emacs视频做的非常好的大牛配置&#xa0;&#xa0;&#xa0;<span class="tag"><span class="config">config</span></span><br />
<div class="outline-text-5" id="text-org4856341">
<p>
<a href="https://github.com/daviwil/dotfiles/blob/9776d65c4486f2fa08ec60a06e86ecb6d2c40085/Emacs.org#fonts-and-bullets">dotfiles/Emacs.org at 9776d65c4486f2fa08ec60a06e86ecb6d2c40085 · daviwil/dotfiles</a>
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgcc0f49f" class="outline-4">
<h4 id="orgcc0f49f">2022-08-04 Thursday</h4>
<div class="outline-text-4" id="text-orgcc0f49f">
</div>
<ul class="org-ul">
<li><a id="org3fe0425"></a><span class="timestamp-wrapper"><span class="timestamp">[2022-08-04 Thu 06:20]</span></span><br />
<ul class="org-ul">
<li><a id="org7d60443"></a><span class="todo TODO">TODO</span> 窗花沟通安装事宜<br />
<div class="outline-text-6" id="text-org7d60443">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-08-04 Thu 09:30&gt;&#x2013;&lt;2022-08-04 Thu 10:00&gt;</span></span>
</p>
</div>
</li>
<li><a id="org42b3de7"></a><span class="todo TODO">TODO</span> 脑图-下一步咖啡店如何做<br />
<div class="outline-text-6" id="text-org42b3de7">
<ul class="org-ul">
<li>研究emacs 脑图实现</li>
</ul>
</div>
</li>
<li><a id="org6f493d1"></a><span class="todo TODO">TODO</span> 牛奶得定了！<br />
<div class="outline-text-6" id="text-org6f493d1">
</div>
</li>
<li><a id="org6497462"></a><span class="todo TODO">TODO</span> 洗澡<br />
<div class="outline-text-6" id="text-org6497462">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-08-04 Thu 20:00&gt;&#x2013;&lt;2022-08-04 Thu 20:05&gt;</span></span>
</p>
</div>
</li>
</ul>
</li>
<li><a id="org727d6c7"></a>时间戳使用&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span>&#xa0;<span class="timestamp">timestamp</span></span><br />
<div class="outline-text-5" id="text-org727d6c7">
<ul class="org-ul">
<li>C-c . 加入agenda显示的时间戳,在所在时间后面再加入则成为时间段</li>
<li>SPC u C-c . 加入不在agenda显示的时间戳</li>
<li>C-c C-s  加入scheduled时间</li>
<li>C-c C-d  加入deadline时间</li>
</ul>
<p>
scheduled 和 deadline 好用但是适合单独使用，因为会在agenda中单独一条显示，如果一个
todo既有deadline又有scheduled，则会显示两条这个todo。会影响观感。如果某件事知道要在
特定时间做，并且知道什么时候完成，建议使用时间段的方式。
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
